## Pandas melt function 
     The melt() function in Pandas is used to transform a DataFrame from a wide format to a long format.
     It is the opposite of pivoting and is useful for reshaping data for analysis or visualization.
       melt() converts multiple columns into two columns:
       - One column for variable names
       - One column for values

In [5]:
import pandas as pd

In [7]:
df = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\movie_ratings_NaN.csv")
df.head(2)

    Genre  Year  Budget(M$)  Ratings %
0  Action  2008          28         48
1  Action  2009         200         63

### --- Basic Melt [ Global Unpivot ] ---

In [12]:
# Without parameters, melt() unpivots ALL columns into 'variable' and 'value'
# This results in a very long DataFrame where every cell from the original table has its own row
pd.melt(df)

      variable      value
0        Genre     Action
1        Genre     Action
2        Genre     Action
3        Genre     Action
4        Genre  Adventure
5        Genre  Adventure
6        Genre     Comedy
7        Genre     Comedy
8        Genre     Comedy
9         Year       2008
10        Year       2009
11        Year       2008
12        Year       2010
13        Year       2009
14        Year       2010
15        Year       2010
16        Year       2008
17        Year       2009
18  Budget(M$)         28
19  Budget(M$)        200
20  Budget(M$)         32
21  Budget(M$)         20
22  Budget(M$)        105
23  Budget(M$)         20
24  Budget(M$)         27
25  Budget(M$)          8
26  Budget(M$)         30
27   Ratings %         48
28   Ratings %         63
29   Ratings %         57
30   Ratings %         52
31   Ratings %         84
32   Ratings %         44
33   Ratings %         70
34   Ratings %         81
35   Ratings %         71

### --- Melting with Identifier Variables ---

In [20]:
# Use 'id_vars' to keep specific columns fixed (unmelted)
# Here, 'Genre' and 'Year' stay as columns, while 'Budget' and 'Ratings' are melted
pd.melt(df,
        id_vars=['Genre','Year']
       )

        Genre  Year    variable  value
0      Action  2008  Budget(M$)     28
1      Action  2009  Budget(M$)    200
2      Action  2008  Budget(M$)     32
3      Action  2010  Budget(M$)     20
4   Adventure  2009  Budget(M$)    105
5   Adventure  2010  Budget(M$)     20
6      Comedy  2010  Budget(M$)     27
7      Comedy  2008  Budget(M$)      8
8      Comedy  2009  Budget(M$)     30
9      Action  2008   Ratings %     48
10     Action  2009   Ratings %     63
11     Action  2008   Ratings %     57
12     Action  2010   Ratings %     52
13  Adventure  2009   Ratings %     84
14  Adventure  2010   Ratings %     44
15     Comedy  2010   Ratings %     70
16     Comedy  2008   Ratings %     81
17     Comedy  2009   Ratings %     71

### --- Targeted Unpivoting with Custom Names ---

In [18]:
# 'id_vars': Columns to keep as identifiers
# 'value_vars': Specific columns you want to unpivot (if omitted, all non-id_vars are used)
# 'var_name': Custom header for the new 'variable' column
# 'value_name': Custom header for the new 'value' column

pd.melt(
    df, 
    id_vars=['Genre', 'Year'], 
    value_vars=['Ratings %'], 
    var_name='Category', 
    value_name='Data'
)

       Genre  Year   Category  Data
0     Action  2008  Ratings %    48
1     Action  2009  Ratings %    63
2     Action  2008  Ratings %    57
3     Action  2010  Ratings %    52
4  Adventure  2009  Ratings %    84
5  Adventure  2010  Ratings %    44
6     Comedy  2010  Ratings %    70
7     Comedy  2008  Ratings %    81
8     Comedy  2009  Ratings %    71